// 活动类型Map映射
export const activityMap = new Map([
    [100, '商户折扣'],
    [102, '桩群折扣'],
    [103, '企业分组'],
    [200, '桩主折扣'],
    [201, '地区运营折扣'],
    [202, '私桩折扣'],
    [300, '私桩返券'],
    [301, '摇一摇'],
    [302, '充电返券'],
    [303, '充电打榜'],
    [304, '推荐礼包'],
    [305, '私桩返现'],
    [400, '充电评价'],
    [401, '反馈信息'],
    [402, '充值返券'],
    [403, '生日礼包'],
    [404, '节日礼包'],
    [405, '充电分享'],
    [406, '升级送礼'],
    [407, '每周礼包']
]);

// 活动状态Map映射
export const activityStatusMap = new Map([
    [1, '启用'],
    [2, '暂停'],
    [3, '停止']
]);